insert into upper values (0,'총류'),(1,'철학'),(2,'종교'),(3,'사회과학'),
(4,'자연과학'),(5,'기술과학'),(6,'예술'),(7,'언어'),(8,'문학'),(100,'임시');
insert into under values (1,'임시',0,100);
insert into under(un_name,un_code,un_up_num) values 
('총류',0,0),('지식,학문일반',1,0),('시스템',3,0),('도서학',10,0),('저작',11,0),('사본,판본,제본',12,0),
('개인서지 및 목록',13,0),('국가별서지 및 목록',14,0),('주제별서지 및 목록',15,0),('특수서지 및 목록',16,0),
('일반서지 및 목록',17,0),('장서목록',18,0),('문헌정보학',20,0),('도서관행정 및 재정',21,0),
('도서관건축 및 설비',22,0),('도서관 경영, 관리',23,0),('수서, 정리 및 보존',24,0),('도서관봉사 및 활동',25,0),

('철학',0,1),('철학 및 이론',1,1),('잡저',2,1),('사전용어',3,1),('강연집',4,1),('연속간행물',5,1),
('총서,전집,선집',8,1),('형이상학',10,1),('방법론',11,1),('존재론',12,1),('우주론,자연철학',13,1),('공간',14,1),
('시간',15,1),('운동과 변화',16,1),('구조',17,1),('힘과에너지',18,1),('물량과 질량',19,1),('인식론,인과론,인간학',20,1),
('인식론',21,1),('인과론',22,1),('자유 및 필연',23,1),('목적론',24,1),('가치론',25,1),('철학적 인각학',26,1),

('종교',0,2),('비교종교학',10,2),('교리',11,2),('종조,창교자',12,2),('경전,성전',13,2),('불교',20,2),
('불교교리',21,2),('제불,보살,불제자',22,2),('경전',23,2),('종교신앙,신앙록',24,2),('포교,교육,교화활동',25,2),('사원론',26,2),
('기독교',30,2),('기독교신학',31,2),('예수 그리스도,사도',32,2),('성서',33,2),('종교신앙,신앙록',34,2),('교회론',36,2),
('도교',40,2),('교의,신선사상',41,2),('교조,개조',42,2),('도장',43,2),('사원론',46,2),('행사,법술',47,2),

('사회과학',0,3),('사회사상',1,3),('잡저',2,3),('사전',3,3),('강연집,수필집',4,3),('연속간행물',5,3),
('통계학',10,3),('아시아',11,3),('유럽',12,3),('아프리카',13,3),('북아메리카',14,3),('남아메리카',15,3),
('경제학',20,3),('경제각론',21,3),('경제정책',22,3),('산업경제 일반',23,3),('기업경제',24,3),('경영',25,3),
('사회학,사회문제',30,3),('사회학',31,3),('사회조직 및 제도',32,3),('사회문제',34,3),('생활문제',35,3),('여성문제',37,3),

('자연과학',0,4),('과학철학,과학이론',1,4),('강연집,수필집,연설문집',4,4),('연속간행물',5,4),('학회,단체,기관,회의',6,4),('전집,총서',8,4),
('수학',10,4),('산수',11,4),('대수학',12,4),('확률론,통계수학',13,4),('해석학',14,4),('기하학',15,4),
('물리학',20,4),('고체역학',21,4),('유체역학',22,4),('기체역학',23,4),('음향학, 진동학',24,4),('광학',25,4),
('열학',26,4),('전기학 및 전자학',27,4),('자기',28,4),('현대물리학',29,4),('화학',30,4),('이론화학과 물리화학',31,4);


insert into sale_state values (1,'취소'),(2,'준비'),(3,'배송'),(4,'도착'),(5,'수령');
/*group by 에러 발생시
SET GLOBAL sql_mode='STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION';
*/

insert into `member_right` values (0,'마스터'),(1,'운영진'),(2,'회원');
insert into `member_state` values (1,'영구정지'),(2,'유저'),(3,'정지');
insert into `grade` values (1,'임시', 0, 0, 0),(2, '신규회원', 0, 0, 0);
insert into `category` values (1, '공지사항'), (2, '가입인사'), (3, '토론게시판'), (4, '도서추천');