insert into upper values (0,'총류'),(1,'철학'),(2,'종교'),(3,'사회과학'),
(4,'자연과학'),(5,'기술과학'),(6,'예술'),(7,'언어'),(8,'문학'),(100,'임시');
insert into under values (1,'임시',0,100);
insert into under(un_name,un_code,un_up_num) values 
('총류',0,0),('지식,학문일반',1,0),('시스템',3,0),('도서학',10,0),('저작',11,0),('사본,판본,제본',12,0),
('개인서지 및 목록',13,0),('국가별서지 및 목록',14,0),('주제별서지 및 목록',15,0),('특수서지 및 목록',16,0),
('일반서지 및 목록',17,0),('장서목록',18,0),('문헌정보학',20,0),('도서관행정 및 재정',21,0),
('도서관건축 및 설비',22,0),('도서관 경영, 관리',23,0),('수서, 정리 및 보존',24,0),('도서관봉사 및 활동',25,0),

('철학',0,1),('철학 및 이론',1,1),('잡저',2,1),('사전용어',3,1),('강연집',4,1),('연속간행물',5,1),
('총서,전집,선집',8,1),('형이상학',10,1),('방법론',11,1),('존재론',12,1),('우주론,자연철학',13,1),('공간',14,1),
('시간',15,1),('운동과 변화',16,1),('구조',17,1),('힘과에너지',18,1),('물량과 질량',19,1),('인식론,인과론,인간학',20,1),
('인식론',21,1),('인과론',22,1),('자유 및 필연',23,1),('목적론',24,1),('가치론',25,1),('철학적 인각학',26,1),

('종교',0,2),('비교종교학',10,2),('교리',11,2),('종조,창교자',12,2),('경전,성전',13,2),('불교',20,2),
('불교교리',21,2),('제불,보살,불제자',22,2),('경전',23,2),('종교신앙,신앙록',24,2),('포교,교육,교화활동',25,2),('사원론',26,2),
('기독교',30,2),('기독교신학',31,2),('예수 그리스도,사도',32,2),('성서',33,2),('종교신앙,신앙록',34,2),('교회론',36,2),
('도교',40,2),('교의,신선사상',41,2),('교조,개조',42,2),('도장',43,2),('사원론',46,2),('행사,법술',47,2),

('사회과학',0,3),('사회사상',1,3),('잡저',2,3),('사전',3,3),('강연집,수필집',4,3),('연속간행물',5,3),
('통계학',10,3),('아시아',11,3),('유럽',12,3),('아프리카',13,3),('북아메리카',14,3),('남아메리카',15,3),
('경제학',20,3),('경제각론',21,3),('경제정책',22,3),('산업경제 일반',23,3),('기업경제',24,3),('경영',25,3),
('사회학,사회문제',30,3),('사회학',31,3),('사회조직 및 제도',32,3),('사회문제',34,3),('생활문제',35,3),('여성문제',37,3),

('자연과학',0,4),('과학철학,과학이론',1,4),('강연집,수필집,연설문집',4,4),('연속간행물',5,4),('학회,단체,기관,회의',6,4),('전집,총서',8,4),
('수학',10,4),('산수',11,4),('대수학',12,4),('확률론,통계수학',13,4),('해석학',14,4),('기하학',15,4),
('물리학',20,4),('고체역학',21,4),('유체역학',22,4),('기체역학',23,4),('음향학, 진동학',24,4),('광학',25,4),
('열학',26,4),('전기학 및 전자학',27,4),('자기',28,4),('현대물리학',29,4),('화학',30,4),('이론화학과 물리화학',31,4),

('기술과학',0,5),('기술철학 및 이론',1,5),('기술사',9,5),('의학',10,5),('기초의학',11,5),('임상의학 일반',12,5),
('내과학',13,5),('외과',14,5),('치과의학,이빈후과학,안과학',15,5),('산부인과,소아과학',16,5),('농업,농학',20,5),('농업기초학',21,5),
('농업경제',22,5),('공학,공업일반,토목공학',30,5),('토목공학',31,5),('토목역학,토목재료',32,5),('측량',33,5),('도로공학',34,5),
('건축공학',40,5),('건축재료',41,5),('건축실무',42,5),('건축구조의 유형',43,5),('친환경건축',44,5),('기계공학',50,5),

('예술',0,6),('미술이론,미학',1,6),('미술의 재료 및 기법',2,6),('미술사전',3,6),('미술의 주제',4,6),('미술사',9,6),
('건축술',10,6),('궁전,성곽',11,6),('종교건물',12,6),('공공건물',13,6),('과학 및 연구용건물',14,6),('공업용건물',15,6),
('상업,교통,통신용건물',16,6),('주거용 건물',17,6),('기타건물',18,6),('장식 및 의장',19,6),('조각 및 조형 미술',20,6),('조소재료및 기법',22,6),
('목조',23,6),('석조',24,6),('금동조',25,6),('점토조소, 소조',26,6),('기타 재료',27,6),('전각, 인장',28,6),

('언어',0,7),('언어학',1,7),('사전',3,7),('강연집',4,7),('언어사',9,7),('한국어',10,7),
('음운, 음성, 문자',11,7),('어원, 어의',12,7),('사전',13,7),('어휘',14,7),('문법',15,7),('중국어',20,7),
('음운, 음성, 문자',21,7),('어원, 어의',22,7),('사전',23,7),('어휘',24,7),('문법, 어법',25,7),('일본어 및 기타 아시아제어',30,7),
('음운, 음성, 문자',31,7),('어원, 어의',32,7),('사전',33,7),('어휘',34,7),('문법, 어법',35,7),('작문',36,7),

('문학',0,8),('문학이론',1,8),('문장작법,수사학',2,8),('전집,총서',8,8),('문학사, 평론',9,8),('한국문학',10,8),
('시',11,8),('희곡',12,8),('소설',13,8),('수필',14,8),('연설,웅변',15,8),('일기, 서간, 기행',16,8),('중국문학',20,8),
('시',21,8),('희곡',22,8),('소설',23,8),('수필',24,8),('연설,웅변',25,8),('일기, 서간, 기행',26,8),('일본문학',30,8),
('시',31,8),('희곡',32,8),('소설',33,8),('수필',34,8),('연설,웅변',35,8),('일기, 서간, 기행',36,8);

insert into sale_state values (1,'준비'),(2,'배송'),(3,'도착'),(4,'수령'),(5,'취소');
/*group by 에러 발생시
SET GLOBAL sql_mode='STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION';
*/

insert into `member_right` values (0,'마스터'),(1,'운영진'),(2,'회원');
insert into `member_state` values (1,'영구정지'),(2,'유저'),(3,'정지');
insert into `grade` values (1,'임시', 0, 0, 0),(2, '신규회원', 0, 0, 0);
insert into `category` values (1, '공지사항'), (2, '가입인사'), (3, '토론게시판'), (4, '도서추천');